Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/WBZ35/atdf/WBZ351.atdf
        <register name="CVDSD2C1" offset="0x120" rw="RW" size="4" initval="0x00000000" caption="CVD SCAN DESCRIPTOR N CONTROL1 REGISTER">
          <bitfield name="SDOVRSAMP" caption="Scan Descriptor Over Sampling0= One measurement1= Two measurements accumulated...127= 128 measurements accumulated" mask="0x7F"/>
          <bitfield name="SDTH" caption="Scan Descriptor Threshold." mask="0xFFFFFF00"/>
        </register>
        <register name="CVDSD3C1" offset="0x130" rw="RW" size="4" initval="0x00000000" caption="CVD SCAN DESCRIPTOR N CONTROL1 REGISTER">
          <bitfield name="SDOVRSAMP" caption="Scan Descriptor Over Sampling0= One measurement1= Two measurements accumulated...127= 128 measurements accumulated" mask="0x7F"/>
          <bitfield name="SDTH" caption="Scan Descriptor Threshold." mask="0xFFFFFF00"/>
        </register>
        <register name="CVDSD0C2" offset="0x104" rw="RW" size="4" initval="0x00000000" caption="CVD SCAN DESCRIPTOR N CONTROL2 REGISTER">
          <bitfield name="SDRXBEG" caption="Scan Descriptor RX Index StartDetermines the first RX index to include in a scan." mask="0x3F"/>
          <bitfield name="SDRXSTRIDE0" caption="Scan Descriptor RX Index StrideDetermines the number of RX Indexes included in a single measurement4'h0= One RX Index4'hF= 16 TX Indexes" mask="0xC0"/>
          <bitfield name="SDRXEND" caption="Scan Descriptor RX Index EndDetermines the last RX index to include in a scan.One the RX index pointer, which is incremented by the SDnRXSTRIDE+1 value, meets or exceeds this value, the RXloop of the scan is complete." mask="0x3F00"/>
          <bitfield name="SDRXSTRIDE1" caption="Scan Descriptor RX Index StrideDetermines the number of RX Indexes included in a single measurement4'h0= One RX Index4'hF= 16 TX Indexes" mask="0xC000"/>
          <bitfield name="SDTXBEG" caption="Scan Descriptor TX Index StartDetermines the first TX index to include in a scan." mask="0x3F0000"/>
          <bitfield name="SDTXSTRIDE0" caption="Scan Descriptor TX Index StrideDetermines the number of TX Indexes included in a single measurement.4'h0= One TX Index4'bF= 16TX Indexes" mask="0xC00000"/>
          <bitfield name="SDTXEND" caption="Scan Descriptor TX Index EndDetermines the last TX index to include in a scan.One the TX index pointer, which is incremented by the SDnTXSTRIDE+1 value, meets or exceeds this value, the TXloop of the scan is complete." mask="0x3F000000"/>
          <bitfield name="SDTXSTRIDE1" caption="Scan Descriptor TX Index StrideDetermines the number of TX Indexes included in a single measurement.4'h0= One TX Index4'bF= 16TX Indexes" mask="0xC0000000"/>
        </register>
        <register name="CVDSD1C2" offset="0x114" rw="RW" size="4" initval="0x00000000" caption="CVD SCAN DESCRIPTOR N CONTROL2 REGISTER">
          <bitfield name="SDRXBEG" caption="Scan Descriptor RX Index StartDetermines the first RX index to include in a scan." mask="0x3F"/>
          <bitfield name="SDRXSTRIDE0" caption="Scan Descriptor RX Index StrideDetermines the number of RX Indexes included in a single measurement4'h0= One RX Index4'hF= 16 TX Indexes" mask="0xC0"/>
          <bitfield name="SDRXEND" caption="Scan Descriptor RX Index EndDetermines the last RX index to include in a scan.One the RX index pointer, which is incremented by the SDnRXSTRIDE+1 value, meets or exceeds this value, the RXloop of the scan is complete." mask="0x3F00"/>
          <bitfield name="SDRXSTRIDE1" caption="Scan Descriptor RX Index StrideDetermines the number of RX Indexes included in a single measurement4'h0= One RX Index4'hF= 16 TX Indexes" mask="0xC000"/>
          <bitfield name="SDTXBEG" caption="Scan Descriptor TX Index StartDetermines the first TX index to include in a scan." mask="0x3F0000"/>
          <bitfield name="SDTXSTRIDE0" caption="Scan Descriptor TX Index StrideDetermines the number of TX Indexes included in a single measurement.4'h0= One TX Index4'bF= 16TX Indexes" mask="0xC00000"/>
          <bitfield name="SDTXEND" caption="Scan Descriptor TX Index EndDetermines the last TX index to include in a scan.One the TX index pointer, which is incremented by the SDnTXSTRIDE+1 value, meets or exceeds this value, the TXloop of the scan is complete." mask="0x3F000000"/>
          <bitfield name="SDTXSTRIDE1" caption="Scan Descriptor TX Index StrideDetermines the number of TX Indexes included in a single measurement.4'h0= One TX Index4'bF= 16TX Indexes" mask="0xC0000000"/>
        </register>
        <register name="CVDSD2C2" offset="0x124" rw="RW" size="4" initval="0x00000000" caption="CVD SCAN DESCRIPTOR N CONTROL2 REGISTER">
          <bitfield name="SDRXBEG" caption="Scan Descriptor RX Index StartDetermines the first RX index to include in a scan." mask="0x3F"/>
          <bitfield name="SDRXSTRIDE0" caption="Scan Descriptor RX Index StrideDetermines the number of RX Indexes included in a single measurement4'h0= One RX Index4'hF= 16 TX Indexes" mask="0xC0"/>
          <bitfield name="SDRXEND" caption="Scan Descriptor RX Index EndDetermines the last RX index to include in a scan.One the RX index pointer, which is incremented by the SDnRXSTRIDE+1 value, meets or exceeds this value, the RXloop of the scan is complete." mask="0x3F00"/>
          <bitfield name="SDRXSTRIDE1" caption="Scan Descriptor RX Index StrideDetermines the number of RX Indexes included in a single measurement4'h0= One RX Index4'hF= 16 TX Indexes" mask="0xC000"/>
          <bitfield name="SDTXBEG" caption="Scan Descriptor TX Index StartDetermines the first TX index to include in a scan." mask="0x3F0000"/>
          <bitfield name="SDTXSTRIDE0" caption="Scan Descriptor TX Index StrideDetermines the number of TX Indexes included in a single measurement.4'h0= One TX Index4'bF= 16TX Indexes" mask="0xC00000"/>
          <bitfield name="SDTXEND" caption="Scan Descriptor TX Index EndDetermines the last TX index to include in a scan.One the TX index pointer, which is incremented by the SDnTXSTRIDE+1 value, meets or exceeds this value, the TXloop of the scan is complete." mask="0x3F000000"/>
          <bitfield name="SDTXSTRIDE1" caption="Scan Descriptor TX Index StrideDetermines the number of TX Indexes included in a single measurement.4'h0= One TX Index4'bF= 16TX Indexes" mask="0xC0000000"/>
        </register>
        <register name="CVDSD3C2" offset="0x134" rw="RW" size="4" initval="0x00000000" caption="CVD SCAN DESCRIPTOR N CONTROL2 REGISTER">
          <bitfield name="SDRXBEG" caption="Scan Descriptor RX Index StartDetermines the first RX index to include in a scan." mask="0x3F"/>
          <bitfield name="SDRXSTRIDE0" caption="Scan Descriptor RX Index StrideDetermines the number of RX Indexes included in a single measurement4'h0= One RX Index4'hF= 16 TX Indexes" mask="0xC0"/>
          <bitfield name="SDRXEND" caption="Scan Descriptor RX Index EndDetermines the last RX index to include in a scan.One the RX index pointer, which is incremented by the SDnRXSTRIDE+1 value, meets or exceeds this value, the RXloop of the scan is complete." mask="0x3F00"/>
          <bitfield name="SDRXSTRIDE1" caption="Scan Descriptor RX Index StrideDetermines the number of RX Indexes included in a single measurement4'h0= One RX Index4'hF= 16 TX Indexes" mask="0xC000"/>
          <bitfield name="SDTXBEG" caption="Scan Descriptor TX Index StartDetermines the first TX index to include in a scan." mask="0x3F0000"/>
          <bitfield name="SDTXSTRIDE0" caption="Scan Descriptor TX Index StrideDetermines the number of TX Indexes included in a single measurement.4'h0= One TX Index4'bF= 16TX Indexes" mask="0xC00000"/>
          <bitfield name="SDTXEND" caption="Scan Descriptor TX Index EndDetermines the last TX index to include in a scan.One the TX index pointer, which is incremented by the SDnTXSTRIDE+1 value, meets or exceeds this value, the TXloop of the scan is complete." mask="0x3F000000"/>
          <bitfield name="SDTXSTRIDE1" caption="Scan Descriptor TX Index StrideDetermines the number of TX Indexes included in a single measurement.4'h0= One TX Index4'bF= 16TX Indexes" mask="0xC0000000"/>
        </register>
        <register name="CVDSD0C3" offset="0x108" rw="RW" size="4" initval="0x00000000" caption="CVD SCAN DESCRIPTOR N CONTROL3 REGISTER">
          <bitfield name="SDCHGTIME" caption="Scan Descriptor Charge TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the CHARGE statedriving both the internal and external capacitor nodes, as well as the TX output(s)" mask="0x7F"/>
          <bitfield name="SDACQTIME" caption="Scan Descriptor Acquire TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the ACQUIRE stateto allow the ADC voltage to settle" mask="0x7F00"/>
          <bitfield name="CVDCPL" caption="Capacitor Voltage Divider (CVD) Setting bits" mask="0x70000"/>
          <bitfield name="CVDEN" caption=" Capacitive Voltage Division Enable bit" mask="0x80000"/>
          <bitfield name="SDMUT" caption="Scan Descriptor Mutual Mode1= Mutual Measurement Mode; TX outputs are part of CVD measurement and are driven0=No Mutual Measurement Mode; TX outputs are not part of CVD measurements" mask="0x1000000"/>
          <bitfield name="SDSELF" caption="Scan Descriptor Mutual Mode1= Self Measurement Mode; RX outputs are part of CVD measurement and are driven0= No Self Measurement; RX outputs are not part of CVD measurements" mask="0x2000000"/>
          <bitfield name="SDINTEN" caption="Scan Descriptor Interrupt Enable1= Scan Descriptor creates an interrupt if the accumulator threshold is met0= Scan descriptor does not create an interrupt" mask="0x4000000"/>
          <bitfield name="SDBUF" caption="Scan Descriptor CVD Buffer Enable1= Use the SOC's CVD Buffer macro to drive the party-line (shared ADC core input) rather than the RX outputs0= SOC's CVD Buffer macro not used to drive party-line (or doesn't exist)" mask="0x8000000"/>
          <bitfield name="SDEN" caption="Scan Descriptor Enable Mode00= Scan Descriptor Disabled01= Execute Scan Descriptor one time only, then clear the enable.10= Execute the Scan Descriptor, but keep enabled. Move on to next enabled descriptors.11= Execute the Scan Descriptor in a loop until a threshold match is detected, then clear the enable and move on tonext enabled descriptors." mask="0xC0000000"/>
        </register>
        <register name="CVDSD1C3" offset="0x118" rw="RW" size="4" initval="0x00000000" caption="CVD SCAN DESCRIPTOR N CONTROL3 REGISTER">
          <bitfield name="SDCHGTIME" caption="Scan Descriptor Charge TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the CHARGE statedriving both the internal and external capacitor nodes, as well as the TX output(s)" mask="0x7F"/>
          <bitfield name="SDACQTIME" caption="Scan Descriptor Acquire TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the ACQUIRE stateto allow the ADC voltage to settle" mask="0x7F00"/>
          <bitfield name="CVDCPL" caption="Capacitor Voltage Divider (CVD) Setting bits" mask="0x70000"/>
          <bitfield name="CVDEN" caption=" Capacitive Voltage Division Enable bit" mask="0x80000"/>
          <bitfield name="SDMUT" caption="Scan Descriptor Mutual Mode1= Mutual Measurement Mode; TX outputs are part of CVD measurement and are driven0=No Mutual Measurement Mode; TX outputs are not part of CVD measurements" mask="0x1000000"/>
          <bitfield name="SDSELF" caption="Scan Descriptor Mutual Mode1= Self Measurement Mode; RX outputs are part of CVD measurement and are driven0= No Self Measurement; RX outputs are not part of CVD measurements" mask="0x2000000"/>
          <bitfield name="SDINTEN" caption="Scan Descriptor Interrupt Enable1= Scan Descriptor creates an interrupt if the accumulator threshold is met0= Scan descriptor does not create an interrupt" mask="0x4000000"/>
          <bitfield name="SDBUF" caption="Scan Descriptor CVD Buffer Enable1= Use the SOC's CVD Buffer macro to drive the party-line (shared ADC core input) rather than the RX outputs0= SOC's CVD Buffer macro not used to drive party-line (or doesn't exist)" mask="0x8000000"/>
          <bitfield name="SDEN" caption="Scan Descriptor Enable Mode00= Scan Descriptor Disabled01= Execute Scan Descriptor one time only, then clear the enable.10= Execute the Scan Descriptor, but keep enabled. Move on to next enabled descriptors.11= Execute the Scan Descriptor in a loop until a threshold match is detected, then clear the enable and move on tonext enabled descriptors." mask="0xC0000000"/>
        </register>
