Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/WBZ35/atdf/WBZ351.atdf
        <register name="CVDBG" offset="0x200" rw="RW" size="4" initval="0x00000000" caption="CVD DEBUG REGISTER">
          <bitfield name="SEL_L" caption="Select signal to MUX debug signals on to port cvd_tst_dbg_data[15:0]" mask="0xFFFF"/>
          <bitfield name="SEL_H" caption="Select signal to MUX debug signals on to port cvd_tst_dbg_data[31:16]" mask="0xFFFF0000"/>
        </register>
      </register-group>
    </module>
    <module name="CoreDebug" id="SYSTEM_IP" version="1.0.0" caption="Core Debug Register">
      <register-group name="CoreDebug" caption="Core Debug Register">
        <register name="DHCSR" offset="0x0" rw="RW" size="4" access-size="4" caption="Debug Halting Control and Status Register">
          <bitfield name="C_DEBUGEN" caption="" mask="0x1"/>
          <bitfield name="C_HALT" caption="" mask="0x2"/>
          <bitfield name="C_STEP" caption="" mask="0x4"/>
          <bitfield name="C_MASKINTS" caption="" mask="0x8"/>
          <bitfield name="C_SNAPSTALL" caption="" mask="0x20"/>
          <bitfield name="S_REGRDY" caption="" mask="0x10000"/>
          <bitfield name="S_HALT" caption="" mask="0x20000"/>
          <bitfield name="S_SLEEP" caption="" mask="0x40000"/>
          <bitfield name="S_LOCKUP" caption="" mask="0x80000"/>
          <bitfield name="S_RETIRE_ST" caption="" mask="0x1000000"/>
          <bitfield name="S_RESET_ST" caption="" mask="0x2000000"/>
        </register>
        <register name="DCRSR" offset="0x4" rw="W" size="4" access-size="4" caption="Debug Core Register Selector Register">
          <bitfield name="REGSEL" caption="" mask="0x1F"/>
          <bitfield name="REGWnR" caption="" mask="0x10000"/>
        </register>
        <register name="DCRDR" offset="0x8" rw="RW" size="4" access-size="4" caption="Debug Core Register Data Register">
        </register>
        <register name="DEMCR" offset="0xC" rw="RW" size="4" access-size="4" caption="Debug Exception and Monitor Control Register">
          <bitfield name="VC_CORERESET" caption="" mask="0x1"/>
          <bitfield name="VC_MMERR" caption="" mask="0x10"/>
          <bitfield name="VC_NOCPERR" caption="" mask="0x20"/>
          <bitfield name="VC_CHKERR" caption="" mask="0x40"/>
          <bitfield name="VC_STATERR" caption="" mask="0x80"/>
          <bitfield name="VC_BUSERR" caption="" mask="0x100"/>
          <bitfield name="VC_INTERR" caption="" mask="0x200"/>
          <bitfield name="VC_HARDERR" caption="" mask="0x400"/>
          <bitfield name="MON_EN" caption="" mask="0x10000"/>
          <bitfield name="MON_PEND" caption="" mask="0x20000"/>
          <bitfield name="MON_STEP" caption="" mask="0x40000"/>
          <bitfield name="MON_REQ" caption="" mask="0x80000"/>
          <bitfield name="TRCENA" caption="" mask="0x1000000"/>
        </register>
      </register-group>
    </module>
    <module name="DAC_CTRL" id="05063" name2="dac_7bit_ctrl_v1" version="A.3 Draft" caption="Descriptive Title of Macro">
      <register-group name="DAC_CTRL" caption="Descriptive Title of Macro">
        <register name="DACCON" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="CONTROL Register">
          <bitfield name="LPRCEN1" caption="LPRC clock enabled for SnH mode" mask="0x20" values="DACCON__LPRCEN1"/>
          <bitfield name="OUTEN" caption="Will enable the output buffer" mask="0x40" values="DACCON__OUTEN"/>
          <bitfield name="SNH" caption="Sample and hold circuitry" mask="0x80" values="DACCON__SNH"/>
          <bitfield name="EN" caption="Enable" mask="0x8000" values="DACCON__EN"/>
        </register>
        <register name="DACCODE" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="DAC CODE Register">
          <bitfield name="DATA" caption="DAC data" mask="0x7F"/>
        </register>
        <register name="DACCON2" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="DAC Config register1">
          <bitfield name="WIDTH" caption="SnH clock width" mask="0x3FF"/>
          <bitfield name="PERIOD" caption="SnH clock period" mask="0x3FF0000"/>
          <bitfield name="PRESCALAR" caption="Prescaling factor for SnH clock" mask="0xE0000000"/>
        </register>
      </register-group>
      <value-group name="DACCON__LPRCEN1">
        <value name="0" caption="LPRC clock not enabled" value="0"/>
        <value name="1" caption="LPRC clock enabled" value="1"/>
      </value-group>
      <value-group name="DACCON__OUTEN">
        <value name="0" caption="Output buffer disabled" value="0"/>
        <value name="1" caption="Output buffer enabled" value="1"/>
      </value-group>
      <value-group name="DACCON__SNH">
        <value name="0" caption="DAC operation in normal mode" value="0"/>
        <value name="1" caption="DAC operation in low power mode" value="1"/>
      </value-group>
      <value-group name="DACCON__EN">
        <value name="0" caption="The peripheral is disabled." value="0"/>
        <value name="1" caption="The peripheral is enabled." value="1"/>
      </value-group>
    </module>
    <module name="DGI_SPI" id="04366" name2="spi_dma_dgi_v1" version="0.1 Draft" caption="SPI DMA for DGI Macro">
      <register-group name="DGI_SPI" caption="SPI DMA for DGI Macro">
        <register name="SPICON" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="SPI control register">
          <bitfield name="GO" caption="DMA Operation Status bitThis bit is set by the user software to start the DMA operation. It is reset back to zero by the DMA engine whenthe DMA operation is completed or aborted by clearing the ON bit." mask="0x1" values="SPICON__GO"/>
          <bitfield name="STXISEL" caption="SPI Transmit Service Request Interrupt SelectFor enhanced buffer mode, the SPI generates a Transmit Service Request when:" mask="0xC" values="SPICON__STXISEL"/>
          <bitfield name="CKP" caption="Clock Polarity Select bit" mask="0x40" values="SPICON__CKP"/>
          <bitfield name="SSCON" caption="SSControl bits" mask="0x80" values="SPICON__SSCON"/>
          <bitfield name="CKE" caption="SPI Clock Edge Select bit" mask="0x100" values="SPICON__CKE"/>
          <bitfield name="MODE" caption="Serial Word Length bits" mask="0xC00"/>
          <bitfield name="DISSDO" caption="Disable SDO bit" mask="0x1000" values="SPICON__DISSDO"/>
          <bitfield name="SIDL" caption="Stop in Idle control bit" mask="0x2000" values="SPICON__SIDL"/>
          <bitfield name="FRZ" caption="Freeze bit (in Debug Mode)" mask="0x4000" values="SPICON__FRZ"/>
          <bitfield name="ON" caption="DGISPI On bit" mask="0x8000" values="SPICON__ON"/>
          <bitfield name="ENHBUF" caption="Enhanced Buffer Enable bit" mask="0x10000" values="SPICON__ENHBUF"/>
          <bitfield name="MCLKEN" caption="Master Clock Enable" mask="0x800000" values="SPICON__MCLKEN"/>
          <bitfield name="MSSEN" caption="Master Mode Slave Select Enable bit" mask="0x10000000" values="SPICON__MSSEN"/>
        </register>
        <register name="SPISTAT" offset="0x10" rw="R" size="4" initval="0x00000008" caption="SPI Status register">
          <bitfield name="SPITBF" caption="SPI Transmit Buffer Full Status bit" mask="0x2" values="SPISTAT__SPITBF"/>
          <bitfield name="SPITBE" caption="SPI Transmit Buffer Empty status bit" mask="0x8" values="SPISTAT__SPITBE"/>
          <bitfield name="SRMT" caption="Shift Register (SPIxSR) Empty bit0= There are current or pending transactions" mask="0x80" values="SPISTAT__SRMT"/>
          <bitfield name="SPIBUSY" caption="SPI activity status bit" mask="0x800" values="SPISTAT__SPIBUSY"/>
          <bitfield name="TXBUFELM" caption="TransmitBuffer Element Count bits (valid only when ENHBUF = 1)" mask="0x1F0000"/>
        </register>
