Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/WBZ35/atdf/WBZ351.atdf
        <register name="ISPR" offset="0x100" rw="RW" size="4" access-size="4" count="2" initval="0" caption="Interrupt Set Pending Register">
          <bitfield name="SETPEND" caption="Interrupt set-pending bits" mask="0xFFFFFFFF"/>
        </register>
        <register name="ICPR" offset="0x180" rw="RW" size="4" access-size="4" count="2" initval="0" caption="Interrupt Clear Pending Register">
          <bitfield name="CLRPEND" caption="Interrupt clear-pending bits" mask="0xFFFFFFFF"/>
        </register>
        <register name="IABR" offset="0x200" rw="RW" size="4" access-size="4" count="2" initval="0" caption="Interrupt Active Bit Register">
          <bitfield name="ACTIVE" caption="Interrupt active bits" mask="0xFFFFFFFF"/>
        </register>
        <register name="IP" offset="0x300" rw="RW" size="1" access-size="1" count="43" initval="0" caption="Interrupt Priority Register n">
          <bitfield name="PRI0" caption="Priority of interrupt n" mask="0x7"/>
        </register>
        <register name="STIR" offset="0xE00" rw="W" size="4" access-size="4" caption="Software Trigger Interrupt Register">
          <bitfield name="INTID" caption="Interrupt ID to trigger" mask="0x1FF"/>
        </register>
      </register-group>
    </module>
    <!--
	<module name="EFUSE" id="EIP_00504" version="1.0.0">
      <register-group name="EFUSE" caption="Efuse Memory Map">
        <register name="SECCFG0" offset="0x0" rw="RW" size="1" initval="0x00" caption="Secure Configuration">
          <bitfield name="UUID_LCK" caption="Programming lock bits for Unique ID fuses" mask="0x30" values="SECCFG__UUID_LCK"/>
          <bitfield name="DEBUG_LCK" caption="Lock bits for debug/programming" mask="0xC0" values="SECCFG__DEBUG_LCK"/>
        </register>
        <register name="SECCFG1" offset="0x1" rw="RW" size="1" initval="0x00" caption="Secure Configuration">
          <bitfield name="ROOT_KEY_LCK" caption="Lock bits for storage root Key" mask="0x3" values="SECCFG__ROOT_KEY_LCK"/>
          <bitfield name="BOOT_KEY_LCK" caption="Lock bits for Secure Boot/OTA Key" mask="0xC" values="SECCFG__BOOT_KEY_LCK"/>
        </register>
        <register name="SECCFG2" offset="0x2" rw="RW" size="1" initval="0x00" caption="Secure Configuration">
          <bitfield name="ADD_BOOT_KEY" caption="Additional boot Key bit" mask="0x1" />
        </register>
        <register name="ANTIROLLBACKCOUNTER" offset="0x4" rw="RW" size="1" count="32" initval="0x00" caption="Anti Roll back counter">
          <bitfield name="ANTIROLLBACKCOUNTER" caption="Anti rollback counter bits" mask="0xFF"/>
        </register>
        <register name="LIFECYCLECOUNTER" offset="0x24" rw="RW" size="1" count="2" initval="0x00" caption="Life cycle counter">
          <bitfield name="LIFECYCLECOUNTER" caption="Life cycle counter bits" mask="0xFF"/>
        </register>
        <register name="SECUREBOOTKEY" offset="0x26" rw="RW" size="1" count="48" initval="0x00" caption="Secure boot key">
          <bitfield name="SECUREBOOTKEY" caption="Secure boot key bits" mask="0xFF"/>
        </register>
        <register name="UUID" offset="0x1D8" rw="RW" size="1" count="16" initval="0x00" caption="Unique ID">
          <bitfield name="UUID" caption="Unique ID bits" mask="0xFF"/>
        </register>
      </register-group>
      <value-group name="SECCFG__UUID_LCK">
        <value name="0" caption="Unique ID is not locked" value="0"/>
        <value name="1" caption="Unique ID is locked and cannot be programmed" value="1"/>
        <value name="2" caption="Unique ID is locked and cannot be programmed" value="2"/>
        <value name="3" caption="Unique ID is locked and cannot be programmed" value="3"/>
      </value-group>
      <value-group name="SECCFG__DEBUG_LCK">
        <value name="0" caption="Debug is not locked" value="0"/>
        <value name="1" caption="Debug is locked" value="1"/>
        <value name="2" caption="Debug is locked" value="2"/>
        <value name="3" caption="Debug is locked" value="3"/>
      </value-group>
      <value-group name="SECCFG__ROOT_KEY_LCK">
        <value name="0" caption="Storage root key is not locked" value="0"/>
        <value name="1" caption="Storage root key is locked and cannot be programmed" value="1"/>
        <value name="2" caption="Storage root key is locked and cannot be programmed" value="2"/>
        <value name="3" caption="Storage root key is locked and cannot be programmed" value="3"/>
      </value-group>
      <value-group name="SECCFG__BOOT_KEY_LCK">
        <value name="0" caption="Secure boot key is not locked" value="0"/>
        <value name="1" caption="Secure boot key is locked and cannot be programmed" value="1"/>
        <value name="2" caption="Secure boot key is locked and cannot be programmed" value="2"/>
        <value name="3" caption="Secure boot key is locked and cannot be programmed" value="3"/>
      </value-group>
    </module>
	-->
    <module name="ROT" id="04599" name2="sec_root_of_trust_v1" version="Rev A.1" caption="Secure Root of Trust Macro">
      <register-group name="ROT" caption="Secure Root of Trust Macro">
        <register name="SECCFG" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Secure Configuration HOLDING REGISTER1,2">
          <bitfield name="UUID_LCK" caption="Programming lock bits for Unique ID fuses" mask="0x30" values="SECCFG__UUID_LCK"/>
          <bitfield name="DEBUG_LCK" caption="Lock bits for debug/programming" mask="0xC0" values="SECCFG__DEBUG_LCK"/>
          <bitfield name="ROOT_KEY_LCK" caption="Lock bits for storage root Key" mask="0x300" values="SECCFG__ROOT_KEY_LCK"/>
          <bitfield name="BOOT_KEY_LCK" caption="Lock bits for Secure Boot/OTA Key" mask="0xC00" values="SECCFG__BOOT_KEY_LCK"/>
          <bitfield name="ADD_BOOT_KEY" caption="Additional boot Key bit" mask="0x10000"/>
        </register>
        <register name="SEC_BOOT" offset="0xC00" rw="RW" size="4" initval="0x00010002" caption="Secure Boot Register">
          <bitfield name="SEC_BOOT_REQD" caption="Bits to indicate that secure boot is required on the next device reset." mask="0x3" values="SEC_BOOT__SEC_BOOT_REQD"/>
          <bitfield name="SEC_BOOT_STATUS" caption="Bits to indicate that secure boot status" mask="0xFF00"/>
          <bitfield name="SEC_BOOT_DONE" caption="Bits to indicate that secure boot is done" mask="0x30000" values="SEC_BOOT__SEC_BOOT_DONE"/>
        </register>
        <register name="EFUSE_RWDATA" offset="0xC04" rw="RW" size="4" initval="0x00000000" caption="EFuse RW Data Register">
          <bitfield name="DATA" caption="eFuse Program (Write) Data" mask="0xFF"/>
          <bitfield name="ADDR" caption="eFuse Program/Read Address" mask="0xFFF0000"/>
        </register>
