Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/WBZ35/atdf/WBZ351.atdf
        <register name="DMA_INT_ENSET" offset="0x20" rw="W" size="4" atomic-op="set:DMA_INT_EN" initval="0x00000000" caption="">
          <bitfield name="INT_ENSET" caption="" mask="0xFFFFFFFF"/>
        </register>
        <register name="DMA_INT_ENCLR" offset="0x24" rw="W" size="4" atomic-op="clear:DMA_INT_EN" initval="0x00000000" caption="">
          <bitfield name="INT_ENCLR" caption="" mask="0xFFFFFFFF"/>
        </register>
        <register name="DMA_INT_STATRAW" offset="0x28" rw="R" size="4" initval="0x00000000" caption="">
          <bitfield name="INT_STATRAW" caption="" mask="0xFFFFFFFF"/>
        </register>
        <register name="DMA_INT_STAT" offset="0x2C" rw="R" size="4" initval="0x00000000" caption="">
          <bitfield name="INT_STAT" caption="" mask="0xFFFFFFFF"/>
        </register>
        <register name="DMA_INT_STATCLR" offset="0x30" rw="W" size="4" atomic-op="clear:DMA_INT_STAT" initval="0x00000000" caption="">
          <bitfield name="INT_STATCLR" caption="" mask="0xFFFFFFFF"/>
        </register>
        <register name="DMA_CONFIG" offset="0x34" rw="RW" size="4" initval="0x00000000" caption="">
          <bitfield name="FETCH_CTRL_INDIRECT" caption="" mask="0x1"/>
          <bitfield name="PUSH_CTRL_INDIRECT" caption="" mask="0x2"/>
          <bitfield name="FETCH_STOP" caption="" mask="0x4"/>
          <bitfield name="PUSH_STOP" caption="" mask="0x8"/>
          <bitfield name="SOFT_RST" caption="" mask="0x10"/>
        </register>
        <register name="DMA_START" offset="0x38" rw="W" size="4" initval="0x00000000" caption="">
          <bitfield name="START_FETCH" caption="" mask="0x1"/>
          <bitfield name="START_PUSH" caption="" mask="0x2"/>
        </register>
        <register name="DMA_STATUS" offset="0x3C" rw="R" size="4" initval="0x00000000" caption="">
          <bitfield name="FETCH_BUSY" caption="" mask="0x1"/>
          <bitfield name="PUSH_BUSY" caption="" mask="0x2"/>
          <bitfield name="FETCH_NOT_EMPTY" caption="" mask="0x10"/>
          <bitfield name="PUSH_WAITINGFIFO" caption="" mask="0x20"/>
          <bitfield name="SOFT_RST_BUSY" caption="" mask="0x40"/>
          <bitfield name="PUSH_NBDATA" caption="" mask="0xFFFF0000"/>
        </register>
        <register name="HWCONF_INCL_IPS_HW_CFG" offset="0x400" rw="R" size="4" initval="0x00000000" caption="">
          <bitfield name="BA411_AES_INCLUDED" caption="Generic g_IncludeAES value. BA411E-AES IP included if set" mask="0x1"/>
          <bitfield name="BA415_HP_AES_GCM_INCLUDED" caption="Generic g_IncludeAESGCM value. BA415-HP-AES-GCM IP included if set" mask="0x2"/>
          <bitfield name="BA416_HP_AES_XTS_INCLUDED" caption="Generic g_IncludeAESXTS value. BA416-HP-AES-XTS IP included if set" mask="0x4"/>
          <bitfield name="BA412_DES_INCLUDED" caption="Generic g_IncludeDES value. BA412-3DES IP included if set" mask="0x8"/>
          <bitfield name="BA413_HASH_INCLUDED" caption="Generic g_IncludeHASH value. BA413-HASH IP included if set" mask="0x10"/>
          <bitfield name="BA417_CHACHAPOLY_INCLUDED" caption="Generic g_IncludeChachaPoly value. BA417-ChaChaPoly IP included if set" mask="0x20"/>
          <bitfield name="BA418_SHA3_INCLUDED" caption="Generic g_IncludeSHA3  value. BA418-SHA3 IP included if set" mask="0x40"/>
          <bitfield name="BA421_ZUC_INCLUDED" caption="Generic g_IncludeZUC  value. BA421-ZUC IP included if set" mask="0x80"/>
          <bitfield name="BA419_SM4_INCLUDED" caption="Generic g_IncludeSM4  value. BA419-SM4 IP included if set" mask="0x100"/>
          <bitfield name="BA414EP_PKE_INCLUDED" caption="Generic g_IncludePKE  value. BA414EP-PKE IP included if set" mask="0x200"/>
          <bitfield name="BA431_NDRNG_INCLUDED" caption="Generic g_IncludeNDRNG  value. BA431-NDRNG IP included if set" mask="0x400"/>
          <bitfield name="BA420_HP_CHACHAPOLY_INCLUDED" caption="Generic g_IncludeHPChachaPoly  value. BA420-HP-ChaChaPoly IP included if set" mask="0x800"/>
          <bitfield name="BA423_SNOW3G_INCLUDED" caption="Generic g_IncludeSnow3G  value. BA423-Snow3G IP included if set" mask="0x1000"/>
          <bitfield name="BA422_KASUMI_INCLUDED" caption="Generic g_IncludeKasumi  value. BA422-Kasumi IP included if set" mask="0x2000"/>
        </register>
        <register name="HWCONF_BA411E_AES_HW_CFG_1" offset="0x404" rw="R" size="4" initval="0x00000000" caption="">
          <bitfield name="BA411E_AES_HW_CFG_MODE" caption="Generic g_AesModesPoss value. BA411E-AES engine configuration." mask="0x1FF"/>
          <bitfield name="BA411E_AES_HW_CFG_CS" caption="Generic g_CS value. BA411E-AES engine configuration." mask="0x10000"/>
          <bitfield name="BA411E_AES_HW_CFG_MASKING" caption="Generic g_UseMasking value. BA411E-AES engine configuration." mask="0x20000"/>
          <bitfield name="BA411E_AES_HW_CFG_KEYSIZE" caption="Generic g_Keysize value. BA411E-AES engine configuration." mask="0x7000000"/>
        </register>
        <register name="HWCONF_BA411E_AES_HW_CFG_2" offset="0x408" rw="R" size="4" initval="0x00000000" caption="Generic g_CtrSize value. BA411E-AES engine configuration.">
          <bitfield name="BA411E_AES_HW_CFG_2" caption="Generic g_CtrSize value. BA411E-AES engine configuration." mask="0xFFFF"/>
        </register>
        <register name="HWCONF_BA413_HASH_HW_CFG" offset="0x40C" rw="R" size="4" initval="0x00000000" caption="">
          <bitfield name="BA413_HASH_HW_CFG_MASK" caption="Generic g_HashMaskFunc value. BA413-Hash engine configuration." mask="0x7F"/>
          <bitfield name="BA413_HASH_HW_CFG_PASSING" caption="Generic g_HashPadding value. BA413-Hash engine configuration." mask="0x10000"/>
          <bitfield name="BA413_HASH_HW_CFG_HMAC" caption="Generic g_HMAC_enabled value. BA413-Hash engine configuration." mask="0x20000"/>
          <bitfield name="BA413_HASH_HW_CFG_VERIFYDIGEST" caption="Generic g_HashVerifyDigest value. BA413-Hash engine configuration." mask="0x40000"/>
        </register>
        <register name="HWCONF_BA418_SHA3_HW_CFG" offset="0x410" rw="R" size="4" initval="0x00000000" caption="Generic g_Sha3CtxtEn value. BA418-SHA3 configuration.">
          <bitfield name="BA418_SHA3_HW_CFG" caption="Generic g_Sha3CtxtEn value. BA418-SHA3 configuration." mask="0x1"/>
        </register>
        <register name="HWCONF_BA419_SM4_HW_CFG" offset="0x414" rw="R" size="4" initval="0x00000000" caption="Generic g_SM4ModesPoss value. BA419-SM4 engine configuration.">
          <bitfield name="BA419_SM4_HW_CFG" caption="Generic g_SM4ModesPoss value. BA419-SM4 engine configuration." mask="0x7F"/>
        </register>
        <register name="HWCONF_BA424_ARIA_HW_CFG" offset="0x418" rw="R" size="4" initval="0x00000000" caption="Generic g_aria_modePoss value. BA424-Aria engine configuration.">
          <bitfield name="BA424_ARIA_HW_CFG" caption="Generic g_aria_modePoss value. BA424-Aria engine configuration." mask="0x1FF"/>
        </register>
        <register name="RNG_CONTROL_CONTROL" offset="0x1000" rw="RW" size="4" initval="0x00000000" caption="Control register">
          <bitfield name="ENABLE" caption="Enable the NDRNG." mask="0x1"/>
          <bitfield name="LFSREN" caption="Select between the NDRNG with asynchronous free running oscillators (when '0') and the Pseudo-Random generator with synchronous oscillators for simulation purpose (when '1')." mask="0x2"/>
          <bitfield name="TESTEN" caption="Select input for conditioning function and continuous tests: 0: Noise source (normal mode), 1: Test data register (test mode)." mask="0x4"/>
          <bitfield name="CONDBYPASS" caption="0: the conditioning function is used (normal mode), 1: the conditioning function is bypassed (to observe entropy source directly)." mask="0x8"/>
          <bitfield name="INTENREP" caption="Interrupt enable for Repetition Count Test failure." mask="0x10"/>
          <bitfield name="INTENPROP" caption="Interrupt enable for Adaptive Proportion Test failure (1024-sample window)." mask="0x20"/>
          <bitfield name="INTENFULL" caption="Interrupt enable for FIFO full." mask="0x80"/>
          <bitfield name="SOFTRST" caption="Software reset: 0: Normal mode, 1: The continuous test, the conditioning function and the FIFO are reset. This bit is not cleared automatically." mask="0x100"/>
          <bitfield name="INTENPRE" caption="Interrupt enable for AIS31 preliminary noise alarm." mask="0x200"/>
          <bitfield name="INTENALM" caption="Interrupt enable for AIS31 noise alarm." mask="0x400"/>
          <bitfield name="FORCEACTIVEROS" caption="Force oscillators to run when FIFO is full." mask="0x800"/>
          <bitfield name="HEALTHTESTBYPASS" caption="Bypass NIST tests such that the results of the start-up and online test do not affect the FSM state." mask="0x1000"/>
          <bitfield name="AIS31BYPASS" caption="Bypass AIS31 tests such that the results of the start-up and online tests do not affect the FSM state." mask="0x2000"/>
          <bitfield name="HEALTHTESTSEL" caption="Select input to health test module: 0: Before conditioning, 1: After conditioning." mask="0x4000"/>
          <bitfield name="AIS31TESTSEL" caption="Select input to the AIS31 test module: 0: Before conditioning, 1: After conditioning." mask="0x8000"/>
          <bitfield name="NB128BITBLOCKS" caption="Number of 128 bit blocks used in AES-CBCMAC post-processing. This value cannot be zero." mask="0xF0000"/>
          <bitfield name="FIFOWRITESTARTUP" caption="Enable write of the samples in the FIFO during start-up." mask="0x100000"/>
        </register>
        <register name="RNG_CONTROL_FIFOLEVEL" offset="0x1004" rw="RW" size="4" initval="0x00000000" caption="FIFO level register.">
          <bitfield name="FIFOLEVEL" caption="Number of 32 bits words of random available in the FIFO. Any write to this register clears the FullInt flag in the Status register." mask="0xFFFFFFFF"/>
        </register>
