Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/WBZ35/atdf/WBZ351.atdf
      <value-group caption="AN7 Mode bit" name="ADCIMCON1__DIFF7">
        <value caption="Selects AN7 differential input pair as AN7+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN7 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN8 Signed Data Mode bit" name="ADCIMCON1__SIGN8">
        <value caption="AN8 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN8 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN 8 Mode bit" name="ADCIMCON1__DIFF8">
        <value caption="Selects AN8 differential input pair as AN8+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN8 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN9 Signed Data Mode bit" name="ADCIMCON1__SIGN9">
        <value caption="AN9 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN9 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN9 Mode bit" name="ADCIMCON1__DIFF9">
        <value caption="Selects AN9 differential input pair as AN9+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN9 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN10 Signed Data Mode bit" name="ADCIMCON1__SIGN10">
        <value caption="AN10 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN10 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN10 Mode bit" name="ADCIMCON1__DIFF10">
        <value caption="Selects AN10 differential input pair as AN10+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN10 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="AN11 Signed Data Mode bit" name="ADCIMCON1__SIGN11">
        <value caption="AN11 is using Signed Data mode" name="SIGNED" value="0x1"/>
        <value caption="AN11 is using Unsigned Data mode" name="UNSIGNED" value="0x0"/>
      </value-group>
      <value-group caption="AN11 Mode bit" name="ADCIMCON1__DIFF11">
        <value caption="Selects AN11 differential input pair as AN11+ and ANN0-" name="DIFF" value="0x1"/>
        <value caption="AN11 is using Single-ended mode" name="SINGLE" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN0">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="ENABLED" value="0x1"/>
        <value caption="Interrupts are disabled" name="DISABLED" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN1">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="ENABLED" value="0x1"/>
        <value caption="Interrupts are disabled" name="DISABLED" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN2">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="ENABLED" value="0x1"/>
        <value caption="Interrupts are disabled" name="DISABLED" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN3">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="ENABLED" value="0x1"/>
        <value caption="Interrupts are disabled" name="DISABLED" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN4">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="ENABLED" value="0x1"/>
        <value caption="Interrupts are disabled" name="DISABLED" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN5">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="ENABLED" value="0x1"/>
        <value caption="Interrupts are disabled" name="DISABLED" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN6">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="ENABLED" value="0x1"/>
        <value caption="Interrupts are disabled" name="DISABLED" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN7">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="ENABLED" value="0x1"/>
        <value caption="Interrupts are disabled" name="DISABLED" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN8">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="ENABLED" value="0x1"/>
        <value caption="Interrupts are disabled" name="DISABLED" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN9">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="ENABLED" value="0x1"/>
        <value caption="Interrupts are disabled" name="DISABLED" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bit" name="ADCGIRQEN1__AGIEN10">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" name="ENABLED" value="0x1"/>
        <value caption="Interrupts are disabled" name="DISABLED" value="0x0"/>
      </value-group>
