Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/WBZ35/atdf/WBZ351.atdf
        <register name="CFGPGQOS" offset="0x50" rw="RW" size="4" access-size="4" initval="0xe044004c" caption="">
          <bitfield name="CPUPG" caption="CPU (Code) Permission Group" mask="0x3"/>
          <bitfield name="CPUQOS" caption="CPU I/D and System Bus QOS Control" mask="0xc"/>
          <bitfield name="DMAPG" caption="DMA (Rd/Wr) Permission Group" mask="0x300"/>
          <bitfield name="DGISPIPG" caption="ADC Controller Permission Group" mask="0x30000"/>
          <bitfield name="DGISPIQOS" caption="ADC Controller QOS Control" mask="0xc0000"/>
          <bitfield name="CRYPTOPG" caption="Crypto Permission Group" mask="0x300000"/>
          <bitfield name="CRYPTOQOS" caption="Crypto QOS Control" mask="0xc00000"/>
          <bitfield name="DSUPG" caption="DSU Permission Group" mask="0x3000000"/>
          <bitfield name="FCQOS" caption="FC Controller QOS Control" mask="0x30000000"/>
          <bitfield name="WISIBQOS" caption="Wireless SIB QOS Control" mask="0xc0000000"/>
        </register>
        <register name="CFGPCLKGEN1" offset="0x60" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="EICCSEL" caption="EIC Clock Selection" mask="0x7" values="PCLKGENSEL"/>
          <bitfield name="EICCD" caption="EIC Clock Disable" mask="0x8" values="PGCLK__CTRL"/>
          <bitfield name="FREQMRCSEL" caption="FREQMRC Clock Selection" mask="0x70" values="PCLKGENSEL"/>
          <bitfield name="FREQMRCD" caption="FREQMRC Clock Disable" mask="0x80" values="PGCLK__CTRL"/>
          <bitfield name="FREQMMCSEL" caption="FREQMMC Clock Selection" mask="0x700" values="PCLKGENSEL"/>
          <bitfield name="FREQMMCD" caption="FREQMMC Clock Disable" mask="0x800" values="PGCLK__CTRL"/>
          <bitfield name="SERCOM01CSEL" caption="SERCOM0/1 Clock Selection" mask="0x7000" values="PCLKGENSEL"/>
          <bitfield name="SERCOM01CD" caption="SERCOM0/1 Clock Disable" mask="0x8000" values="PGCLK__CTRL"/>
          <bitfield name="SERCOM2CSEL" caption="SERCOM2/3 Clock Selection" mask="0x70000" values="PCLKGENSEL"/>
          <bitfield name="SERCOM2CD" caption="SERCOM2/3 Clock Disable" mask="0x80000" values="PGCLK__CTRL"/>
          <bitfield name="TCC12CSEL" caption="TCC1/2 Clock Selection" mask="0x700000" values="PCLKGENSEL"/>
          <bitfield name="TCC12CD" caption="TCC1/2 Clock Disable" mask="0x800000" values="PGCLK__CTRL"/>
          <bitfield name="CM4TCSEL" caption="CM4T Clock Selection" mask="0x70000000" values="PCLKGENSEL"/>
          <bitfield name="CM4TCD" caption="CM4T Clock Disable" mask="0x80000000" values="PGCLK__CTRL"/>
        </register>
        <register name="CFGPCLKGEN2" offset="0x70" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="EVSYSC1SEL" caption="EVSYSC1 Peripheral Clock Selection" mask="0x7" values="PCLKGENSEL"/>
          <bitfield name="EVSYSC1CD" caption="EVSYSC1 Clock Disable" mask="0x8" values="PGCLK__CTRL"/>
          <bitfield name="EVSYSC2SEL" caption="EVSYSC2 Peripheral Clock Selection" mask="0x70" values="PCLKGENSEL"/>
          <bitfield name="EVSYSC2CD" caption="EVSYSC2 Clock Disable" mask="0x80" values="PGCLK__CTRL"/>
          <bitfield name="EVSYSC3SEL" caption="EVSYSC3 Peripheral Clock Selection" mask="0x700" values="PCLKGENSEL"/>
          <bitfield name="EVSYSC3CD" caption="EVSYSC3 Clock Disable" mask="0x800" values="PGCLK__CTRL"/>
          <bitfield name="EVSYSC4SEL" caption="EVSYSC4 Peripheral Clock Selection" mask="0x7000" values="PCLKGENSEL"/>
          <bitfield name="EVSYSC4CD" caption="EVSYSC4 Clock Disable" mask="0x8000" values="PGCLK__CTRL"/>
          <bitfield name="EVSYSC5SEL" caption="EVSYSC5 Peripheral Clock Selection" mask="0x70000" values="PCLKGENSEL"/>
          <bitfield name="EVSYSC5CD" caption="EVSYSC5 Clock Disable" mask="0x80000" values="PGCLK__CTRL"/>
          <bitfield name="EVSYSC6SEL" caption="EVSYSC6 Peripheral Clock Selection" mask="0x700000" values="PCLKGENSEL"/>
          <bitfield name="EVSYSC6CD" caption="EVSYSC6 Clock Disable" mask="0x800000" values="PGCLK__CTRL"/>
          <bitfield name="EVSYSC7SEL" caption="EVSYSC7 Peripheral Clock Selection" mask="0x7000000" values="PCLKGENSEL"/>
          <bitfield name="EVSYSC7CD" caption="EVSYSC7 Clock Disable" mask="0x8000000" values="PGCLK__CTRL"/>
          <bitfield name="EVSYSC8SEL" caption="EVSYSC8 Peripheral Clock Selection" mask="0x70000000" values="PCLKGENSEL"/>
          <bitfield name="EVSYSC8CD" caption="EVSYSC8 Clock Disable" mask="0x80000000" values="PGCLK__CTRL"/>
        </register>
        <register name="CFGPCLKGEN3" offset="0x80" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="EVSYSC9SEL" caption="EVSYSC9 Peripheral Clock Selection" mask="0x7" values="PCLKGENSEL"/>
          <bitfield name="EVSYSC9CD" caption="EVSYSC9 Clock Disable" mask="0x8" values="PGCLK__CTRL"/>
          <bitfield name="EVSYSC10SEL" caption="EVSYSC10 Peripheral Clock Selection" mask="0x70" values="PCLKGENSEL"/>
          <bitfield name="EVSYSC10CD" caption="EVSYSC10 Clock Disable" mask="0x80" values="PGCLK__CTRL"/>
          <bitfield name="EVSYSC11SEL" caption="EVSYSC11 Peripheral Clock Selection" mask="0x700" values="PCLKGENSEL"/>
          <bitfield name="EVSYSC11CD" caption="EVSYSC11 Clock Disable" mask="0x800" values="PGCLK__CTRL"/>
          <bitfield name="EVSYSC12SEL" caption="EVSYSC12 Peripheral Clock Selection" mask="0x7000" values="PCLKGENSEL"/>
          <bitfield name="EVSYSC12CD" caption="EVSYSC12 Clock Disable" mask="0x8000" values="PGCLK__CTRL"/>
          <bitfield name="ACCSEL" caption="AC Peripheral Clock Selection" mask="0x70000" values="PCLKGENSEL"/>
          <bitfield name="ACCD" caption="AC Clock Disable" mask="0x80000" values="PGCLK__CTRL"/>
          <bitfield name="TCC0CSEL" caption="TCC0 Peripheral Clock Selection" mask="0x700000" values="PCLKGENSEL"/>
          <bitfield name="TCC0CD" caption="TCC0 Clock Disable" mask="0x800000" values="PGCLK__CTRL"/>
        </register>
