Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/WBZ35/atdf/WBZ351.atdf
      <value-group caption="Peripheral Stop in Idle Mode bit" name="REFO6CON__SIDL">
        <value caption="Discontinue module operation when device enters Idle mode" name="SIDL" value="0x1"/>
        <value caption="Continue module operation in Idle mode" name="NO_SIDL" value="0x0"/>
      </value-group>
      <value-group caption="Freeze in Debug mode bit" name="REFO6CON__FRZ">
        <value caption="When emulator is in Debug mode, module freezes operation" name="FRZ" value="0x1"/>
        <value caption="When emulator is in Debug mode, module continues operation" name="NO_FRZ" value="0x0"/>
      </value-group>
      <value-group caption="Output Enable bit" name="REFO6CON__ON">
        <value caption="Reference Oscillator Module enabled" name="ON" value="0x1"/>
        <value caption="Reference Oscillator Module disabled" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Reference Clock Divider bits" name="REFO6CON__RODIV">
        <value caption="REFO6 clock is Base clock frequency divided by 65,534 (32,767 *2)" name="65K" value="0x7fff"/>
        <value caption="REFO6 clock is Base clock frequency divided by 4 (2*2)" name="4" value="0x2"/>
        <value caption="REFO6 clock is Base clock frequency divided by 2 (1*2)" name="2" value="0x1"/>
        <value caption="REFO6 clock is same frequency as Base clock (no divider)" name="NONE" value="0x0"/>
      </value-group>
      <value-group caption="Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO6 clock" name="REFO6TRIM__ROTRIM">
        <value caption="0/512 (0.0) divisor added to RODIV value" name="ZERO" value="0x0"/>
        <value caption="1/512 (0.001953125) divisor added to RODIV value" name="1" value="0x1"/>
        <value caption="2/512 (0.00390625) divisor added to RODIV value" name="2" value="0x2"/>
        <value caption="256/512 (0.5000) divisor added to RODIV value" name="256" value="0x100"/>
        <value caption="511/512 (0.998046875) divisor added to RODIV value" name="511" value="0x1ff"/>
      </value-group>
      <value-group caption="PB1 Peripheral Clock Divisor Control value" name="PB1DIV__PBDIV">
        <value caption="Divide by 1 PB1 Clock same frequency as sys_clk" name="DIV1" value="0x0"/>
        <value caption="Divide by 2 PB1 Clock is 1/2 of sys_clk" name="DIV2" value="0x1"/>
        <value caption="Divide by 3 PB1 Clock is 1/3 of sys_clk" name="DIV3" value="0x2"/>
        <value caption="Divide by 16 PB1 Clock is 1/16 of sys_clk" name="DIV16" value="0xf"/>
        <value caption="Divide by 17 PB1 Clock is 1/17 of sys_clk" name="DIV17" value="0x10"/>
        <value caption="Divide by 127 PB1 Clock is 1/127 of sys_clk" name="DIV127" value="0x7e"/>
        <value caption="Divide by 128 PB1 Clock is 1/128 of sys_clk" name="DIV128" value="0x7f"/>
      </value-group>
      <value-group caption="PB1 Peripheral Clock Divisor Ready" name="PB1DIV__PBDIVRDY">
        <value caption="Indicates the PB clock divisor logic is not switching divisors and the PB1DIV may be written." name="PB1RDY" value="0x1"/>
        <value caption="Indicates the PB clock divisor logic is currently switching values and the PB1DIV cannot be written." name="NOT_PB1RDY" value="0x0"/>
      </value-group>
      <value-group caption="Output Enable bit" name="PB1DIV__PBDIVON">
        <value caption="PB1 Output clock is enabled" name="PB1ON" value="0x1"/>
        <value caption="PB1 Output clock is disabled" name="PB1OFF" value="0x0"/>
      </value-group>
      <value-group caption="PB2 Peripheral Clock Divisor Control value" name="PB2DIV__PBDIV">
        <value caption="Divide by 1 PB2 Clock same frequency as sys_clk" name="DIV1" value="0x0"/>
        <value caption="Divide by 2 PB2 Clock is 1/2 of sys_clk" name="DIV2" value="0x1"/>
        <value caption="Divide by 3 PB2 Clock is 1/3 of sys_clk" name="DIV3" value="0x2"/>
        <value caption="Divide by 16 PB2 Clock is 1/16 of sys_clk" name="DIV16" value="0xf"/>
        <value caption="Divide by 17 PB2 Clock is 1/17 of sys_clk" name="DIV17" value="0x10"/>
        <value caption="Divide by 127 PB2 Clock is 1/127 of sys_clk" name="DIV127" value="0x7e"/>
        <value caption="Divide by 128 PB2 Clock is 1/128 of sys_clk" name="DIV128" value="0x7f"/>
      </value-group>
      <value-group caption="PB2 Peripheral Clock Divisor Ready" name="PB2DIV__PBDIVRDY">
        <value caption="Indicates the PB clock divisor logic is not switching divisors and the PB2DIV may be written." name="PB2RDY" value="0x1"/>
        <value caption="Indicates the PB clock divisor logic is currently switching values and the PB2DIV cannot be written." name="NOT_PB2RDY" value="0x0"/>
      </value-group>
      <value-group caption="Output Enable bit" name="PB2DIV__PBDIVON">
        <value caption="PB2 Output clock is enabled" name="PB2ON" value="0x1"/>
        <value caption="PB2 Output clock is disabled" name="PB2OFF" value="0x0"/>
      </value-group>
      <value-group caption="PB3 Peripheral Clock Divisor Control value" name="PB3DIV__PBDIV">
        <value caption="Divide by 1 PB3 Clock same frequency as sys_clk" name="DIV1" value="0x0"/>
        <value caption="Divide by 2 PB3 Clock is 1/2 of sys_clk" name="DIV2" value="0x1"/>
        <value caption="Divide by 3 PB3 Clock is 1/3 of sys_clk" name="DIV3" value="0x2"/>
        <value caption="Divide by 16 PB3 Clock is 1/16 of sys_clk" name="DIV16" value="0xf"/>
        <value caption="Divide by 17 PB3 Clock is 1/17 of sys_clk" name="DIV17" value="0x10"/>
        <value caption="Divide by 127 PB3 Clock is 1/127 of sys_clk" name="DIV127" value="0x7e"/>
        <value caption="Divide by 128 PB3 Clock is 1/128 of sys_clk" name="DIV128" value="0x7f"/>
      </value-group>
      <value-group caption="PB3 Peripheral Clock Divisor Ready" name="PB3DIV__PBDIVRDY">
        <value caption="Indicates the PB clock divisor logic is not switching divisors and the PB3DIV may be written." name="PB3RDY" value="0x1"/>
        <value caption="Indicates the PB clock divisor logic is currently switching values and the PB3DIV cannot be written." name="NOT_PB3RDY" value="0x0"/>
      </value-group>
      <value-group caption="Output Enable bit" name="PB3DIV__PBDIVON">
        <value caption="PB3 Output clock is enabled" name="PB3ON" value="0x1"/>
        <value caption="PB3 Output clock is disabled" name="PB3OFF" value="0x0"/>
      </value-group>
