Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/WBZ35/atdf/WBZ351.atdf
        <register name="DMTCONCLR" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="DMTCONSET" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="DMTCONINV" offset="0xc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="DMTPRECLRCLR" offset="0x14" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="DMTPRECLRSET" offset="0x18" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="DMTPRECLRINV" offset="0x1c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="DMTCLRCLR" offset="0x24" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="DMTCLRSET" offset="0x28" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="DMTCLRINV" offset="0x2c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="DMTSTATCLR" offset="0x34" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="DMTSTATSET" offset="0x38" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="DMTSTATINV" offset="0x3c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="DMTCNTCLR" offset="0x44" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="DMTCNTSET" offset="0x48" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="DMTCNTINV" offset="0x4c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="DMTHOLDREGCLR" offset="0x54" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="DMTHOLDREGSET" offset="0x58" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="DMTHOLDREGINV" offset="0x5c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="DMTPSCNTCLR" offset="0x64" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="DMTPSCNTSET" offset="0x68" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="DMTPSCNTINV" offset="0x6c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
        <register name="DMTPSINTVCLR" offset="0x74" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit clear register"/>
        <register name="DMTPSINTVSET" offset="0x78" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit set register"/>
        <register name="DMTPSINTVINV" offset="0x7c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Bit invert register"/>
      </register-group>
    </module>
    <module name="DSCON" id="04824" version="1.0" caption="">
      <register-group name="DSCON" caption="">
        <register name="DSCON" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DSSR" caption="" mask="0x1"/>
          <bitfield name="ZPBOR" caption="" mask="0x2"/>
          <bitfield name="RTCCWDIS" caption="" mask="0x100"/>
          <bitfield name="RTCPWREQ" caption="" mask="0x1000"/>
          <bitfield name="XSEMAEN" caption="" mask="0x2000"/>
          <bitfield name="DSEN" caption="" mask="0x8000"/>
        </register>
        <register name="DSWAKE" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="ICD" caption="" mask="0x2"/>
          <bitfield name="MCLR" caption="" mask="0x4"/>
          <bitfield name="RTCC" caption="" mask="0x8"/>
          <bitfield name="DSWDT" caption="" mask="0x10"/>
          <bitfield name="EXT" caption="" mask="0x20"/>
          <bitfield name="FAULT" caption="" mask="0x80"/>
          <bitfield name="INT0" caption="" mask="0x100"/>
        </register>
        <register name="DSSEMA1" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DSSEMA" caption="" mask="0xffffffff"/>
        </register>
        <register name="DSXSEMA1" offset="0x10" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="DSXSEMA" caption="" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
    </module>
    <module name="EIC" id="U2254" version="3.0.0" caption="External Interrupt Controller">
      <register-group name="EIC" caption="External Interrupt Controller">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="CKSEL" caption="Clock Selection" mask="0x10" values="EIC_CTRLA__CKSEL"/>
        </register>
        <register name="NMICTRL" offset="0x1" rw="RW" size="1" initval="0x00" caption="Non-Maskable Interrupt Control">
          <bitfield name="NMISENSE" caption="Non-Maskable Interrupt Sense Configuration" mask="0x7" values="EIC_NMICTRL__NMISENSE"/>
          <bitfield name="NMIFILTEN" caption="Non-Maskable Interrupt Filter Enable" mask="0x8"/>
          <bitfield name="NMIASYNCH" caption="Asynchronous Edge Detection Mode" mask="0x10" values="EIC_NMICTRL__NMIASYNCH"/>
        </register>
        <register name="NMIFLAG" offset="0x2" rw="RW" size="2" atomic-op="clear:NMIFLAG" initval="0x0000" caption="Non-Maskable Interrupt Flag Status and Clear">
          <bitfield name="NMI" caption="Non-Maskable Interrupt" mask="0x1"/>
        </register>
        <register name="SYNCBUSY" offset="0x4" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy Status" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable Synchronization Busy Status" mask="0x2"/>
        </register>
        <register name="EVCTRL" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Event Control">
          <bitfield name="EXTINTEO" caption="External Interrupt Event Output Enable" mask="0xF"/>
        </register>
        <register name="INTENCLR" offset="0xC" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="EXTINT" caption="External Interrupt Enable" mask="0xF"/>
        </register>
