Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/WBZ35/atdf/WBZ351.atdf
        <register name="DEVCFG1" initval="0x1410443b" offset="0x114" size="4" rw="RW" caption="USER Page CFGCON1 Fuses">
          <bitfield name="TRCEN" caption="Trace Enable" mask="0x20" values="DEVCFG1__TRCEN"/>
          <bitfield name="ECC_SEL_MEM" caption="ECC row selection bit" mask="0x40" values="DEVCFG1__ECC_SEL_MEM"/>
          <bitfield name="ZBTWKSYS" caption="ZBT Subsystem External Wake-up source" mask="0x80" values="DEVCFG1__ZBTWKSYS"/>
          <bitfield name="CMP0_OE" caption="Analog Comparator-0 Output Enable" mask="0x100" values="DEVCFG1__CMP0_OE"/>
          <bitfield name="CMP1_OE" caption="Analog Comparator-1 Output Enable" mask="0x200" values="DEVCFG1__CMP1_OE"/>
          <bitfield name="SLRCTRL0" caption="I2C Slew Rate Control for SERCOM0" mask="0x800" values="DEVCFG1__SLRCTRL0"/>
          <bitfield name="SLRCTRL1" caption="I2C Slew Rate Control for SERCOM1" mask="0x1000" values="DEVCFG1__SLRCTRL1"/>
          <bitfield name="SLRCTRL2" caption="I2C Slew Rate Control for SERCOM2" mask="0x2000" values="DEVCFG1__SLRCTRL2"/>
          <bitfield name="SMCLR" caption="Selects CRU handling of MCLR Control" mask="0x4000" values="DEVCFG1__SMCLR"/>
          <bitfield name="QSCHE_EN" caption="QSPI Address Space Cache Attribute" mask="0x8000" values="DEVCFG1__QSCHE_EN"/>
          <bitfield name="QSPI_HSEN" caption="QSPI Direct (High Speed) Pin Enable" mask="0x10000" values="DEVCFG1__QSPI_HSEN"/>
          <bitfield name="SCOM0_HSEN" caption="SERCOM0 Direct (High Speed) Pin Enable" mask="0x20000" values="DEVCFG1__SCOM0_HSEN"/>
          <bitfield name="SCOM1_HSEN" caption="SERCOM1 Direct (High Speed) Pin Enable" mask="0x40000" values="DEVCFG1__SCOM1_HSEN"/>
          <bitfield name="CCL_OE" caption="CCL Pads (via PPS) Output Enable" mask="0x100000" values="DEVCFG1__CCL_OE"/>
          <bitfield name="I2CDSEL0" caption="I2C Delay Select for SERCOM0" mask="0x200000" values="DEVCFG1__I2CDSEL0"/>
          <bitfield name="I2CDSEL1" caption="I2C Delay Select for SERCOM1" mask="0x400000" values="DEVCFG1__I2CDSEL1"/>
          <bitfield name="I2CDSEL2" caption="I2C Delay Select for SERCOM2" mask="0x800000" values="DEVCFG1__I2CDSEL2"/>
          <bitfield name="WDTPSS" caption="Watchdog Timer Post-scale Select Sleep" mask="0x1f000000" values="DEVCFG1__WDTPSS"/>
          <bitfield name="QSPIDDRM" caption="QSPI DDR Mode Clock Enable" mask="0x20000000" values="DEVCFG1__QSPIDDRM"/>
          <bitfield name="CLKZBREF" caption="External Reference Clock ZB Enable" mask="0x40000000" values="DEVCFG1__CLKZBREF"/>
        </register>
        <register name="DEVCFG0" initval="0x7100000b" offset="0x118" size="4" rw="RW" caption="USER Page CFGCON0 Fuses">
          <bitfield name="SWOEN" caption="SWO enable on 2-wire debug interface" mask="0x2" values="DEVCFG0__SWOEN"/>
          <bitfield name="TROEN" caption="Trace Output Enable" mask="0x4" values="DEVCFG0__TROEN"/>
          <bitfield name="ADCPOVR" caption="ADC Charge Pump Override" mask="0x10" values="DEVCFG0__ADCPOVR"/>
          <bitfield name="ACCMP1_ALTEN" caption="AC CMP1 Alternate Enable" mask="0x40" values="DEVCFG0__ACCMP1_ALTEN"/>
          <bitfield name="CPENFILT" caption="ADC CP Filter Enable" mask="0x80" values="DEVCFG0__CPENFILT"/>
          <bitfield name="RTCIN0_ALTEN" caption="RTCIN0 Alternate Enable" mask="0x100" values="DEVCFG0__RTCIN0_ALTEN"/>
          <bitfield name="RTCOUT_ALTEN" caption="RTCOUT Alternate Enable" mask="0x200" values="DEVCFG0__RTCOUT_ALTEN"/>
          <bitfield name="SMBUSEN0" caption="SMBus Enable for SERCOM0" mask="0x20000" values="DEVCFG0__SMBUSEN0"/>
          <bitfield name="SMBUSEN1" caption="SMBus Enable for SERCOM1" mask="0x40000" values="DEVCFG0__SMBUSEN1"/>
          <bitfield name="HPLUGDIS" caption="Hot Plugging Disable" mask="0x100000" values="DEVCFG0__HPLUGDIS"/>
          <bitfield name="SLRTEN0" caption="SLRT Enable for SERCOM0" mask="0x200000" values="DEVCFG0__SLRTEN0"/>
          <bitfield name="SLRTEN1" caption="SLRT Enable for SERCOM1" mask="0x400000" values="DEVCFG0__SLRTEN1"/>
          <bitfield name="SLRTEN2" caption="SLRT Enable for SERCOM2" mask="0x800000" values="DEVCFG0__SLRTEN2"/>
          <bitfield name="PCM" caption="PCHE I/D Cacheable Mode" mask="0x1000000" values="DEVCFG0__PCM"/>
          <bitfield name="INT0E" caption="INT0 Enable" mask="0x2000000" values="DEVCFG0__INT0E"/>
          <bitfield name="INT0P" caption="INT0P Polarity" mask="0x4000000" values="DEVCFG0__INT0P"/>
          <bitfield name="FECCCON" caption="Flash ECC Control" mask="0x30000000" values="DEVCFG0__FECCCON"/>
          <bitfield name="FRECCDIS" caption="Flex RAM ECC Control" mask="0x40000000" values="DEVCFG0__FRECCDIS"/>
        </register>
        <register name="FBCFG0" initval="0x00000002" offset="0x11C" size="4" rw="RW" caption="NVR BCFG User Configuration Area">
          <bitfield name="BINFOVALID" caption="BCFG info valid" mask="0x80000000" values="FBCFG0__BINFOVALID"/>
          <bitfield name="PCSCMODE" caption="PCache Single cache Mode" mask="0x00000002" values="FBCFG0__PCSCMODE"/>
        </register>
        <register name="FCPN3" initval="0xFFFFFFFF" offset="0x130" size="4" rw="RW" caption="RESERVED"/>
        <register name="FCPN2" initval="0xFFFFFFFF" offset="0x134" size="4" rw="RW" caption="RESERVED"/>
        <register name="FCPN1" initval="0xFFFFFFFF" offset="0x138" size="4" rw="RW" caption="RESERVED"/>
        <register name="FCPN0" initval="0x10000000" offset="0x13C" size="4" rw="RW" caption="NVR CPN Register">
          <bitfield caption="Boot Code Protect" mask="0x10000000" name="CP" values="FCPN0__CP"/>
        </register>
        <!-- Alternative backup config locations -->
        <register name="ALTFBCFG7" initval="0xFFFFFFFF" offset="0x0" size="4" rw="RW" caption="RESERVED"/>
        <register name="ALTFBCFG6" initval="0xFFFFFFFF" offset="0x4" size="4" rw="RW" caption="RESERVED"/>
        <register name="ALTFUSERID" initval="0x0000FFFF" offset="0x8" size="4" rw="RW" caption="ALT USERID"/>
        <register name="ALTDEVCFG4" initval="0x840e4000" offset="0xC" size="4" rw="RW" caption="ALT CFGCON4 Fuses"/>
        <register name="ALTDEVCFG2" initval="0x5f74ff38" offset="0x10" size="4" rw="RW" caption="ALT CFGCON2 Fuses"/>
        <register name="ALTDEVCFG1" initval="0x1410443b" offset="0x14" size="4" rw="RW" caption="ALT CFGCON1 Fuses"/>
