Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/WBZ35/atdf/WBZ351.atdf
        <register name="ALTDEVCFG0" initval="0x7100000b" offset="0x18" size="4" rw="RW" caption="ALT CFGCON0 Fuses"/>
        <register name="ALTFBCFG0" initval="0x80000002" offset="0x1C" size="4" rw="RW" caption="ALT NVR BCFG0"/>
        <register name="ALTFCPN3" initval="0xFFFFFFFF" offset="0x30" size="4" rw="RW" caption="RESERVED"/>
        <register name="ALTFCPN2" initval="0xFFFFFFFF" offset="0x34" size="4" rw="RW" caption="RESERVED"/>
        <register name="ALTFCPN1" initval="0xFFFFFFFF" offset="0x38" size="4" rw="RW" caption="RESERVED"/>
        <register name="ALTFCPN0" initval="0x10000000" offset="0x3C" size="4" rw="RW" caption="ALT NVR CPN Register"/>
      </register-group>
      <!-- DEVCFG0 -->
      <value-group name="DEVCFG0__TDOEN">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__SWOEN">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__TROEN">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__ADCPOVR">
        <value name="HW" caption="" value="0x0"/>
        <value name="SW" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__ACCMP1_ALTEN">
        <value name="PA6" caption="" value="0x1"/>
        <value name="PA13" caption="" value="0x0"/>
      </value-group>
      <value-group name="DEVCFG0__CPENFILT">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__RTCIN0_ALTEN">
        <value name="PA3" caption="" value="0x0"/>
        <value name="PA9" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__RTCOUT_ALTEN">
        <value name="PA4" caption="" value="0x0"/>
        <value name="PA10" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__VBCMODE">
        <value name="DIRECT" caption="" value="0x0"/>
        <value name="INDIR" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__SMBUSEN0">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__SMBUSEN1">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__HPLUGDIS">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__SLRTEN0">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__SLRTEN1">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__SLRTEN2">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__PCM">
        <value name="CPU" caption="" value="0x0"/>
        <value name="SFR" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__INT0E">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__INT0P">
        <value name="NEG" caption="" value="0x0"/>
        <value name="POS" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG0__FECCCON">
        <value name="ON" caption="" value="0x0"/>
        <value name="DYNAMIC" caption="" value="0x1"/>
        <value name="OFF" caption="" value="0x3"/>
      </value-group>
      <value-group name="DEVCFG0__FRECCDIS">
        <value name="OFF" caption="" value="0x1"/>
        <value name="ON" caption="" value="0x0"/>
      </value-group>
      <!-- DEVCFG1 -->
      <value-group name="DEVCFG1__TRCEN">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG1__ECC_SEL_MEM">
        <value name="ROWA" caption="" value="0x0"/>
        <value name="ROWB" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG1__ZBTWKSYS">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG1__CMP0_OE">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG1__CMP1_OE">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG1__SLRCTRL0">
        <value name="GPIO" caption="" value="0x0"/>
        <value name="SERCOM" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG1__SLRCTRL1">
        <value name="GPIO" caption="" value="0x0"/>
        <value name="SERCOM" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG1__SLRCTRL2">
        <value name="GPIO" caption="" value="0x0"/>
        <value name="SERCOM" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG1__SMCLR">
        <value name="NO_POR" caption="" value="0x1"/>
        <value name="FAUX_POR" caption="" value="0x0"/>
      </value-group>
      <value-group name="DEVCFG1__QSCHE_EN">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG1__QSPI_HSEN">
        <value name="PPS" caption="" value="0x0"/>
        <value name="DIRECT" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG1__SCOM0_HSEN">
        <value name="PPS" caption="" value="0x0"/>
        <value name="DIRECT" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG1__SCOM1_HSEN">
        <value name="PPS" caption="" value="0x0"/>
        <value name="DIRECT" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG1__CCL_OE">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG1__I2CDSEL0">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG1__I2CDSEL1">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG1__I2CDSEL2">
        <value name="OFF" caption="" value="0x0"/>
        <value name="ON" caption="" value="0x1"/>
      </value-group>
      <value-group name="DEVCFG1__QSPIDDRM">
        <value name="ON" caption="" value="0x1"/>
        <value name="OFF" caption="" value="0x0"/>
      </value-group>
      <value-group name="DEVCFG1__CLKZBREF">
        <value name="ON" caption="" value="0x01"/>
        <value name="OFF" caption="" value="0x0"/>
      </value-group>
