Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/WBZ35/atdf/WBZ351.atdf
        <register name="CNENSET" offset="0x88" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNENINV" offset="0x8C" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNSTAT" offset="0x90" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CNSTAT0" caption="" mask="0x1"/>
          <bitfield name="CNSTAT1" caption="" mask="0x2"/>
          <bitfield name="CNSTAT2" caption="" mask="0x4"/>
          <bitfield name="CNSTAT3" caption="" mask="0x8"/>
          <bitfield name="CNSTAT4" caption="" mask="0x10"/>
          <bitfield name="CNSTAT5" caption="" mask="0x20"/>
          <bitfield name="CNSTAT6" caption="" mask="0x40"/>
          <bitfield name="CNSTAT7" caption="" mask="0x80"/>
          <bitfield name="CNSTAT8" caption="" mask="0x100"/>
          <bitfield name="CNSTATA" caption="" mask="0x200"/>
          <bitfield name="CNSTAT10" caption="" mask="0x400"/>
          <bitfield name="CNSTAT11" caption="" mask="0x800"/>
          <bitfield name="CNSTAT12" caption="" mask="0x1000"/>
          <bitfield name="CNSTAT13" caption="" mask="0x2000"/>
          <bitfield name="CNSTAT14" caption="" mask="0x4000"/>
        </register>
        <register name="CNSTATCLR" offset="0x94" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNSTATSET" offset="0x98" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNSTATINV" offset="0x9C" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNNE" offset="0xa0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CNNE0" caption="" mask="0x1"/>
          <bitfield name="CNNE1" caption="" mask="0x2"/>
          <bitfield name="CNNE2" caption="" mask="0x4"/>
          <bitfield name="CNNE3" caption="" mask="0x8"/>
          <bitfield name="CNNE4" caption="" mask="0x10"/>
          <bitfield name="CNNE5" caption="" mask="0x20"/>
          <bitfield name="CNNE6" caption="" mask="0x40"/>
          <bitfield name="CNNE7" caption="" mask="0x80"/>
          <bitfield name="CNNE8" caption="" mask="0x100"/>
          <bitfield name="CNNE9" caption="" mask="0x200"/>
          <bitfield name="CNNE10" caption="" mask="0x400"/>
          <bitfield name="CNNE11" caption="" mask="0x800"/>
          <bitfield name="CNNE12" caption="" mask="0x1000"/>
          <bitfield name="CNNE13" caption="" mask="0x2000"/>
          <bitfield name="CNNE14" caption="" mask="0x4000"/>
        </register>
        <register name="CNNECLR" offset="0xa4" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNNESET" offset="0xa8" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNNEINV" offset="0xaC" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNF" offset="0xb0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CNF0" caption="" mask="0x1"/>
          <bitfield name="CNF1" caption="" mask="0x2"/>
          <bitfield name="CNF2" caption="" mask="0x4"/>
          <bitfield name="CNF3" caption="" mask="0x8"/>
          <bitfield name="CNF4" caption="" mask="0x10"/>
          <bitfield name="CNF5" caption="" mask="0x20"/>
          <bitfield name="CNF6" caption="" mask="0x40"/>
          <bitfield name="CNF7" caption="" mask="0x80"/>
          <bitfield name="CNF8" caption="" mask="0x100"/>
          <bitfield name="CNF9" caption="" mask="0x200"/>
          <bitfield name="CNF10" caption="" mask="0x400"/>
          <bitfield name="CNF11" caption="" mask="0x800"/>
          <bitfield name="CNF12" caption="" mask="0x1000"/>
          <bitfield name="CNF13" caption="" mask="0x2000"/>
          <bitfield name="CNF14" caption="" mask="0x4000"/>
        </register>
        <register name="CNFCLR" offset="0xb4" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNFSET" offset="0xb8" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="CNFINV" offset="0xbC" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="SRCON0" offset="0xc0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SR00" caption="" mask="0x1"/>
          <bitfield name="SR01" caption="" mask="0x2"/>
          <bitfield name="SR02" caption="" mask="0x4"/>
          <bitfield name="SR03" caption="" mask="0x8"/>
          <bitfield name="SR04" caption="" mask="0x10"/>
          <bitfield name="SR05" caption="" mask="0x20"/>
          <bitfield name="SR06" caption="" mask="0x40"/>
          <bitfield name="SR07" caption="" mask="0x80"/>
          <bitfield name="SR08" caption="" mask="0x100"/>
          <bitfield name="SR09" caption="" mask="0x200"/>
          <bitfield name="SR010" caption="" mask="0x400"/>
          <bitfield name="SR011" caption="" mask="0x800"/>
          <bitfield name="SR012" caption="" mask="0x1000"/>
          <bitfield name="SR013" caption="" mask="0x2000"/>
          <bitfield name="SR014" caption="" mask="0x4000"/>
        </register>
        <register name="SRCON0CLR" offset="0xc4" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="SRCON0SET" offset="0xc8" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="SRCON0INV" offset="0xcC" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="SRCON1" offset="0xd0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SR10" caption="" mask="0x1"/>
          <bitfield name="SR11" caption="" mask="0x2"/>
          <bitfield name="SR12" caption="" mask="0x4"/>
          <bitfield name="SR13" caption="" mask="0x8"/>
          <bitfield name="SR14" caption="" mask="0x10"/>
          <bitfield name="SR15" caption="" mask="0x20"/>
          <bitfield name="SR16" caption="" mask="0x40"/>
          <bitfield name="SR17" caption="" mask="0x80"/>
          <bitfield name="SR18" caption="" mask="0x100"/>
          <bitfield name="SR19" caption="" mask="0x200"/>
          <bitfield name="SR110" caption="" mask="0x400"/>
          <bitfield name="SR111" caption="" mask="0x800"/>
          <bitfield name="SR112" caption="" mask="0x1000"/>
          <bitfield name="SR113" caption="" mask="0x2000"/>
          <bitfield name="SR114" caption="" mask="0x4000"/>
        </register>
        <register name="SRCON1CLR" offset="0xd4" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="SRCON1SET" offset="0xd8" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
        <register name="SRCON1INV" offset="0xdC" rw="RW" size="4" access-size="4" initval="0x00000000" caption=""/>
      </register-group>
    </module>
    <module name="HMATRIX2TOP" id="04585" version="6.0.0" caption="HSB Matrix">
      <register-group name="PRS" size="0x8">
        <register name="PRAS" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Priority A for Slave">
        </register>
        <register name="PRBS" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Priority B for Slave">
        </register>
      </register-group>
      <register-group name="HMATRIX2TOP" caption="HSB Matrix">
        <register-group name="PRS" name-in-module="PRS" offset="0x080" size="0x8" count="16"/>
      </register-group>
    </module>
    <module name="PAC" id="U2120" version="3.0.0" caption="Peripheral Access Controller">
      <register-group name="PAC" caption="Peripheral Access Controller">
        <register name="WRCTRL" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Write control">
          <bitfield name="PERID" caption="Peripheral identifier" mask="0xFFFF"/>
          <bitfield name="KEY" caption="Peripheral access control key" mask="0xFF0000" values="PAC_WRCTRL__KEY"/>
        </register>
        <register name="EVCTRL" offset="0x4" rw="RW" size="1" initval="0x00" caption="Event control">
          <bitfield name="ERREO" caption="Peripheral acess error event output" mask="0x1"/>
        </register>
