Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/WBZ35/atdf/WBZ351.atdf
      <value-group name="DSSIZESEL">
        <value name="NO_SRAM_RETENTION" caption="FlexRAM is completely powered OFF" value="0x0"/>
        <value name="16K_SRAM" caption="16K Flex RAM available in retention" value="0x1"/>
        <value name="32K_SRAM" caption="32K Flex RAM available in retention" value="0x2"/>
        <value name="RESERVED" caption="Reserved" value="0x3"/>
      </value-group>
    </module>
    <!-- THIS IS FOR 48-PIN DEVICE ONLY -->
    <module name="PPS" id="U148" version="1.0" caption="PPS">
      <register-group name="PPS" caption="'PPS">
        <!-- Next lines are INPUT function pin mappings -->
        <register name="EXTINT0R" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="EXTINT0" caption="EXTINT0" mask="0xf" values="EXTINT0_PINS"/>
        </register>
        <register name="EXTINT1R" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="EXTINT1" caption="EXTINT1" mask="0xf" values="EXTINT1_PINS"/>
        </register>
        <register name="EXTINT2R" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="EXTINT2" caption="EXTINT2" mask="0xf" values="EXTINT2_PINS"/>
        </register>
        <register name="EXTINT3R" offset="0xc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="EXTINT3" caption="EXTINT3" mask="0xf" values="EXTINT3_PINS"/>
        </register>
        <register name="NMIR" offset="0x3c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="NMI" caption="NMI" mask="0xf" values="NMI_PINS"/>
        </register>
        <register name="SCOM0P0R" offset="0x40" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM0P0" caption="SERCOM0/PAD0" mask="0xf" values="SCOM0P0_PINS"/>
        </register>
        <register name="SCOM0P1R" offset="0x44" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM0P1" caption="SERCOM0/PAD1" mask="0xf" values="SCOM0P1_PINS"/>
        </register>
        <register name="SCOM0P2R" offset="0x48" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM0P2" caption="SERCOM0/PAD2" mask="0xf" values="SCOM0P2_PINS"/>
        </register>
        <register name="SCOM0P3R" offset="0x4c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM0P3" caption="SERCOM0/PAD3" mask="0xf" values="SCOM0P3_PINS"/>
        </register>
        <register name="SCOM1P0R" offset="0x50" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM1P0" caption="SERCOM1/PAD0" mask="0xf" values="SCOM1P0_PINS"/>
        </register>
        <register name="SCOM1P1R" offset="0x54" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM1P1" caption="SERCOM1/PAD1" mask="0xf" values="SCOM1P1_PINS"/>
        </register>
        <register name="SCOM1P2R" offset="0x58" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM1P2" caption="SERCOM1/PAD2" mask="0xf" values="SCOM1P2_PINS"/>
        </register>
        <register name="SCOM1P3R" offset="0x5c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="SCOM1P3" caption="SERCOM1/PAD3" mask="0xf" values="SCOM1P3_PINS"/>
        </register>
        <register name="QD0R" offset="0x84" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="QD0" caption="QSPI/DATA0" mask="0xf" values="QD0_PINS"/>
        </register>
        <register name="QD1R" offset="0x88" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="QD1" caption="QSPI/DATA1" mask="0xf" values="QD1_PINS"/>
        </register>
        <register name="QD2R" offset="0x8c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="QD2" caption="QSPI/DATA2" mask="0xf" values="QD2_PINS"/>
        </register>
        <register name="QD3R" offset="0x90" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="QD3" caption="QSPI/DATA3" mask="0xf" values="QD3_PINS"/>
        </register>
        <register name="REFIR" offset="0x94" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="REFI" caption="REFI" mask="0xf" values="REFI_PINS"/>
        </register>
        <register name="CCLIN0R" offset="0x98" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CCLIN0" caption="CCL/IN0" mask="0xf" values="CCLIN0_PINS"/>
        </register>
        <register name="CCLIN1R" offset="0x9c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CCLIN1" caption="CCL/IN1" mask="0xf" values="CCLIN1_PINS"/>
        </register>
        <register name="CCLIN2R" offset="0xa0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CCLIN2" caption="CCL/IN2" mask="0xf" values="CCLIN2_PINS"/>
        </register>
        <register name="CCLIN3R" offset="0xa4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CCLIN3" caption="CCL/IN3" mask="0xf" values="CCLIN3_PINS"/>
        </register>
        <register name="CCLIN4R" offset="0xa8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CCLIN4" caption="CCL/IN4" mask="0xf" values="CCLIN4_PINS"/>
        </register>
        <register name="CCLIN5R" offset="0xac" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="CCLIN5" caption="CCL/IN5" mask="0xf" values="CCLIN5_PINS"/>
        </register>
        <register name="TC0WO0G1R" offset="0xb0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC0WO0" caption="TC0/WO0G1" mask="0xf" values="TC0WO0G1_PINS"/>
        </register>
        <register name="TC0WO0G2R" offset="0xb4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC0WO0" caption="TC0/WO0G2" mask="0xf" values="TC0WO0G2_PINS"/>
        </register>
        <register name="TC0WO1G3R" offset="0xb8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC0WO1" caption="TC0/WO1G3" mask="0xf" values="TC0WO1G3_PINS"/>
        </register>
        <register name="TC0WO1G4R" offset="0xbc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC0WO1" caption="TC0/WO1G4" mask="0xf" values="TC0WO1G4_PINS"/>
        </register>
