Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/WBZ35/atdf/WBZ351.atdf
        <register name="TC1WO0G1R" offset="0xc0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC1WO0" caption="TC1/WO0G1" mask="0xf" values="TC1WO0G1_PINS"/>
        </register>
        <register name="TC1WO1G2R" offset="0xc4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC1WO1" caption="TC1/WO1G2" mask="0xf" values="TC1WO1G2_PINS"/>
        </register>
        <register name="TC2WO0G1R" offset="0xc8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC2WO0" caption="TC2/WO0G1" mask="0xf" values="TC2WO0G1_PINS"/>
        </register>
        <register name="TC2WO0G3R" offset="0xcc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC2WO0" caption="TC2/WO0G3" mask="0xf" values="TC2WO0G3_PINS"/>
        </register>
        <register name="TC2WO1G2R" offset="0xd0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC2WO1" caption="TC2/WO1G2" mask="0xf" values="TC2WO1G2_PINS"/>
        </register>
        <register name="TC2WO1G4R" offset="0xd4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC2WO1" caption="TC2/WO1G4" mask="0xf" values="TC2WO1G4_PINS"/>
        </register>
        <register name="TC3WO0G1R" offset="0xd8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC3WO0" caption="TC3/WO0G1" mask="0xf" values="TC3WO0G1_PINS"/>
        </register>
        <register name="TC3WO0G3R" offset="0xdc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC3WO0" caption="TC3/WO0G3" mask="0xf" values="TC3WO0G3_PINS"/>
        </register>
        <register name="TC3WO1G2R" offset="0xe0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC3WO1" caption="TC3/WO1G2" mask="0xf" values="TC3WO1G2_PINS"/>
        </register>
        <register name="TC3WO1G4R" offset="0xe4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC3WO1" caption="TC3/WO1G4" mask="0xf" values="TC3WO1G4_PINS"/>
        </register>
        <register name="TC4WO0G1R" offset="0xe8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC4WO0" caption="TC4/WO0G1" mask="0xf" values="TC4WO0G1_PINS"/>
        </register>
        <register name="TC4WO0G3R" offset="0xec" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC4WO0" caption="TC4/WO0G3" mask="0xf" values="TC4WO0G3_PINS"/>
        </register>
        <register name="TC4WO1G2R" offset="0xf0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC4WO1" caption="TC4/WO1G2" mask="0xf" values="TC4WO1G2_PINS"/>
        </register>
        <register name="TC4WO1G4R" offset="0xf4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC4WO1" caption="TC4/WO1G4" mask="0xf" values="TC4WO1G4_PINS"/>
        </register>
        <register name="TC5WO0G1R" offset="0xf8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC5WO0" caption="TC5/WO0G1" mask="0xf" values="TC5WO0G1_PINS"/>
        </register>
        <register name="TC5WO0G3R" offset="0xfc" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC5WO0" caption="TC5/WO0G3" mask="0xf" values="TC5WO0G3_PINS"/>
        </register>
        <register name="TC5WO1G2R" offset="0x100" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC5WO1" caption="TC5/WO1G2" mask="0xf" values="TC5WO1G2_PINS"/>
        </register>
        <register name="TC5WO1G4R" offset="0x104" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC5WO1" caption="TC5/WO1G4" mask="0xf" values="TC5WO1G4_PINS"/>
        </register>
        <register name="TC6WO0G1R" offset="0x108" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC6WO0" caption="TC6/WO0G1" mask="0xf" values="TC6WO0G1_PINS"/>
        </register>
        <register name="TC6WO0G3R" offset="0x10c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC6WO0" caption="TC6/WO0G3" mask="0xf" values="TC6WO0G3_PINS"/>
        </register>
        <register name="TC6WO1G2R" offset="0x110" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC6WO1" caption="TC6/WO1G2" mask="0xf" values="TC6WO1G2_PINS"/>
        </register>
        <register name="TC6WO1G4R" offset="0x114" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC6WO1" caption="TC6/WO1G4" mask="0xf" values="TC6WO1G4_PINS"/>
        </register>
        <register name="TC7WO0G1R" offset="0x118" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC7WO0" caption="TC7/WO0G1" mask="0xf" values="TC7WO0G1_PINS"/>
        </register>
        <register name="TC7WO0G3R" offset="0x11c" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC7WO0" caption="TC7/WO0G3" mask="0xf" values="TC7WO0G3_PINS"/>
        </register>
        <register name="TC7WO1G2R" offset="0x120" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC7WO1" caption="TC7/WO1G2" mask="0xf" values="TC7WO1G2_PINS"/>
        </register>
        <register name="TC7WO1G4R" offset="0x124" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="TC7WO1" caption="TC7/WO1G4" mask="0xf" values="TC7WO1G4_PINS"/>
        </register>
        <!-- Next lines are OUTPUT pin mappings -->
        <register name="RPA0G2R" offset="0x200" rw="RW" size="4" access-size="4" initval="0x00000000" caption="">
          <bitfield name="RPA0G2R" caption="RPA0/G2" mask="0x1f" values="RPA0G2_PINS"/>
        </register>
