Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/WBZ35/atdf/WBZ351.atdf
      <value-group name="RPA1G4_PINS" caption="Group4">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="SCOM0P2" caption="SERCOM0/PAD2" value="1"/>
        <value name="SCOM0P0" caption="SERCOM0/PAD0" value="3"/>
        <value name="SCOM1P3" caption="SERCOM1/PAD3" value="4"/>
        <value name="SCOM1P0" caption="SERCOM1/PAD0" value="6"/>
        <value name="TCC0WO3" caption="TCC0/WO3" value="7"/>
        <value name="TCC0WO1" caption="TCC0/WO1" value="8"/>
        <value name="TCC0WO5" caption="TCC0/WO5" value="9"/>
        <value name="TCC1WO3" caption="TCC1/WO3" value="10"/>
        <value name="TCC1WO1" caption="TCC1/WO1" value="11"/>
        <value name="TCC1WO5" caption="TCC1/WO5" value="12"/>
        <value name="TCC2WO1" caption="TCC2/WO1" value="13"/>
        <value name="TC0WO0" caption="TC0/WO0" value="15"/>
        <value name="TC1WO1" caption="TC1/WO1" value="16"/>
        <value name="TC2WO1" caption="TC2/WO1" value="17"/>
        <value name="TC3WO1" caption="TC3/WO1" value="18"/>
        <value name="TC4WO1" caption="TC4/WO1" value="19"/>
        <value name="TC5WO1" caption="TC5/WO1" value="20"/>
        <value name="TC6WO1" caption="TC6/WO1" value="21"/>
        <value name="TC7WO1" caption="TC7/WO1" value="22"/>
        <value name="QCS" caption="QCS" value="23"/>
        <value name="QD2" caption="QD2" value="24"/>
        <value name="QD1" caption="QD1" value="25"/>
        <value name="QD0" caption="QD0" value="26"/>
        <value name="CCLOUT1" caption="CCLOUT1" value="27"/>
        <value name="TSTBUS2" caption="TSTBUS2" value="28"/>
        <value name="TSTBUS5" caption="TSTBUS5" value="29"/>
        <value name="TSTBUS8" caption="TSTBUS8" value="30"/>
        <value name="TSTBUS11" caption="TSTBUS11" value="31"/>
      </value-group>
      <value-group name="RPA2G4_PINS" caption="Group4">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="SCOM0P2" caption="SERCOM0/PAD2" value="1"/>
        <value name="SCOM0P0" caption="SERCOM0/PAD0" value="3"/>
        <value name="SCOM1P3" caption="SERCOM1/PAD3" value="4"/>
        <value name="SCOM1P0" caption="SERCOM1/PAD0" value="6"/>
        <value name="TCC0WO3" caption="TCC0/WO3" value="7"/>
        <value name="TCC0WO1" caption="TCC0/WO1" value="8"/>
        <value name="TCC0WO5" caption="TCC0/WO5" value="9"/>
        <value name="TCC1WO3" caption="TCC1/WO3" value="10"/>
        <value name="TCC1WO1" caption="TCC1/WO1" value="11"/>
        <value name="TCC1WO5" caption="TCC1/WO5" value="12"/>
        <value name="TCC2WO1" caption="TCC2/WO1" value="13"/>
        <value name="TC0WO0" caption="TC0/WO0" value="15"/>
        <value name="TC1WO1" caption="TC1/WO1" value="16"/>
        <value name="TC2WO1" caption="TC2/WO1" value="17"/>
        <value name="TC3WO1" caption="TC3/WO1" value="18"/>
        <value name="TC4WO1" caption="TC4/WO1" value="19"/>
        <value name="TC5WO1" caption="TC5/WO1" value="20"/>
        <value name="TC6WO1" caption="TC6/WO1" value="21"/>
        <value name="TC7WO1" caption="TC7/WO1" value="22"/>
        <value name="QCS" caption="QCS" value="23"/>
        <value name="QD2" caption="QD2" value="24"/>
        <value name="QD1" caption="QD1" value="25"/>
        <value name="QD0" caption="QD0" value="26"/>
        <value name="CCLOUT1" caption="CCLOUT1" value="27"/>
        <value name="TSTBUS2" caption="TSTBUS2" value="28"/>
        <value name="TSTBUS5" caption="TSTBUS5" value="29"/>
        <value name="TSTBUS8" caption="TSTBUS8" value="30"/>
        <value name="TSTBUS11" caption="TSTBUS11" value="31"/>
      </value-group>
      <value-group name="RPA3G1_PINS" caption="Group1">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="SCOM0P1" caption="SERCOM0/PAD1" value="1"/>
        <value name="SCOM1P1" caption="SERCOM1/PAD1" value="2"/>
        <value name="REFO1" caption="REFO1" value="3"/>
        <value name="REFO2" caption="REFO2" value="4"/>
        <value name="REFO3" caption="REFO3" value="5"/>
        <value name="REFO4" caption="REFO4" value="6"/>
        <value name="QSCK" caption="QSCK" value="7"/>
      </value-group>
      <value-group name="RPA3G2_PINS" caption="Group2">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="SCOM0P0" caption="SERCOM0/PAD0" value="1"/>
        <value name="SCOM0P3" caption="SERCOM0/PAD3" value="2"/>
        <value name="SCOM0P2" caption="SERCOM0/PAD2" value="3"/>
        <value name="SCOM1P3" caption="SERCOM1/PAD3" value="5"/>
        <value name="SCOM1P2" caption="SERCOM1/PAD2" value="6"/>
        <value name="TCC0WO1" caption="TCC0/WO1" value="7"/>
        <value name="TCC0WO5" caption="TCC0/WO5" value="8"/>
        <value name="TCC0WO3" caption="TCC0/WO3" value="9"/>
        <value name="TCC1WO1" caption="TCC1/WO1" value="10"/>
        <value name="TCC1WO5" caption="TCC1/WO5" value="11"/>
        <value name="TCC1WO3" caption="TCC1/WO3" value="12"/>
        <value name="TCC2WO1" caption="TCC2/WO1" value="13"/>
        <value name="TC0WO1" caption="TC0/WO1" value="15"/>
        <value name="TC1WO1" caption="TC1/WO1" value="16"/>
        <value name="TC2WO1" caption="TC2/WO1" value="17"/>
        <value name="TC3WO1" caption="TC3/WO1" value="18"/>
        <value name="TC4WO1" caption="TC4/WO1" value="19"/>
        <value name="TC5WO1" caption="TC5/WO1" value="20"/>
        <value name="TC6WO1" caption="TC6/WO1" value="21"/>
        <value name="TC7WO1" caption="TC7/WO1" value="22"/>
        <value name="QSPICS" caption="QSPI/CS" value="23"/>
        <value name="QD0" caption="QD0" value="24"/>
        <value name="QD3" caption="QD3" value="25"/>
        <value name="QD2" caption="QD2" value="26"/>
        <value name="CCLOUT1" caption="CCLOUT1" value="27"/>
        <value name="TSTBUS0" caption="TSTBUS0" value="28"/>
        <value name="TSTBUS3" caption="TSTBUS3" value="29"/>
        <value name="TSTBUS6" caption="TSTBUS6" value="30"/>
        <value name="TSTBUS9" caption="TSTBUS9" value="31"/>
      </value-group>
      <value-group name="RPA3G3_PINS" caption="Group3">
        <value name="OFF" caption="OFF" value="0"/>
        <value name="SCOM0P0" caption="SERCOM0/PAD0" value="2"/>
        <value name="SCOM0P3" caption="SERCOM0/PAD3" value="3"/>
        <value name="SCOM1P2" caption="SERCOM1/PAD2" value="4"/>
        <value name="SCOM1P3" caption="SERCOM1/PAD3" value="6"/>
        <value name="TCC0WO2" caption="TCC0/WO2" value="7"/>
        <value name="TCC0WO0" caption="TCC0/WO0" value="8"/>
        <value name="TCC0WO4" caption="TCC0/WO4" value="9"/>
        <value name="TCC1WO2" caption="TCC1/WO2" value="10"/>
        <value name="TCC1WO0" caption="TCC1/WO0" value="11"/>
        <value name="TCC1WO4" caption="TCC1/WO4" value="12"/>
        <value name="TCC2WO0" caption="TCC2/WO0" value="13"/>
        <value name="TC0WO0" caption="TC0/WO0" value="15"/>
        <value name="TC1WO0" caption="TC1/WO0" value="16"/>
        <value name="TC2WO0" caption="TC2/WO0" value="17"/>
        <value name="TC3WO0" caption="TC3/WO0" value="18"/>
        <value name="TC4WO0" caption="TC4/WO0" value="19"/>
        <value name="TC5WO0" caption="TC5/WO0" value="20"/>
        <value name="TC6WO0" caption="TC6/WO0" value="21"/>
        <value name="TC7WO0" caption="TC7/WO0" value="22"/>
        <value name="QCS" caption="QCS" value="23"/>
        <value name="QD1" caption="QD1" value="24"/>
        <value name="QD0" caption="QD0" value="25"/>
        <value name="QD3" caption="QD3" value="26"/>
        <value name="CCLOUT0" caption="CCLOUT0" value="27"/>
        <value name="TSTBUS1" caption="TSTBUS1" value="28"/>
        <value name="TSTBUS4" caption="TSTBUS4" value="29"/>
        <value name="TSTBUS7" caption="TSTBUS7" value="30"/>
        <value name="TSTBUS10" caption="TSTBUS10" value="31"/>
      </value-group>
